_posts/language/2024-05-17-impinge.html
---
layout: post
title: 单词本：impinge
tags: [English]
categories: [language]
---
<p>
昨天在看以太网高级物理层技术的时候，看到这句话：
</p>

<p>
Importantly, Ethernet-APL also affords coexistence of application
protocols in the same architecture, even over the same pair of
wires. This means that using HART-IP to communicate with process
instruments and control valves doesn&rsquo;t <b>impinge</b> on using an alternative
protocol for other application domains.
</p>

<p>
这里说用 Ethernet-APL 打通工业现场层后，就可以在同一根网线上面运行各种不同的基于 IP 的协议，而互相不影响。
</p>

<p>
词组impinge on/upon sth的意思是have an effect on sth,对某事物起作用或有影响。
</p>

<p>
比如爱沙尼亚反对欧盟的数字经济增值税法案，认为影响中小企业的业务，用到了 impinge： the deemed supplier model would <b>impinge on</b> the principles
of VAT neutrality for SME&rsquo;s who work with platforms within the
aforementioned sectors.
</p>

<p>
还有苏格兰克拉克曼南郡的一位居民的一个 9 米多高的树，影响了邻居的花园生活：&ldquo;The trees <b>impinge on</b> the owner&rsquo;s enjoyment of their rear
garden.
</p>

<p>
还有丹佛大都会州立学院的学生正在调研影响个体建康和福利的各种因素：
Students examine the diverse factors that <b>impinge on</b> an individual&rsquo;s
health and well-being.
</p>

<p>
这是一个比较书面的用语。一般我们口语里不太用。
</p>

<p>
拆开来看，impinge 是由 im 和 pinge 组成的。 im ，in，en 等都表示里面的意思，pinge 则来自拉丁语 pangere 意思是用力紧固、固定等意思。连在一起，就是用力固定到里面，往里用力固定。稍一转化，就是起作用、影响到的意思了。
</p>

<p>
而 pangere 也有变化形式 pact ，pac等。这就引出了很多词汇：
</p>
<ul class="org-ul">
<li>compact 集中紧固，就是紧凑、坚实的意思了。比如
<ul class="org-ul">
<li>a compact mass of sand, 坚实的沙堆。</li>
<li>Stamp the soil down so that it&rsquo;s compact.</li>
<li>a compact car, 紧凑型汽车</li>
</ul></li>
<li>impact 这个和 impinge 有点类似，有撞击、冲击、压入等意思。比如：
<ul class="org-ul">
<li>The bomb exploded on impact. 炸弹在撞击时立即爆炸。</li>
<li>He collapsed under the full impact of the blow. 他受重击而倒下。</li>
<li>Her speech made a tremendous impact on everyone. 她的演讲（在精神上）对大家冲击很大。</li>
</ul></li>
<li>pacific 平和的、和平的，其实是被压平了。太平洋 The pacific ocean.</li>
<li>pacify 使某人息怒，压平火气。
<ul class="org-ul">
<li>He tried to pacify his creditors by repaying part of the money. 他为了安抚债权人偿还了部分借款。</li>
</ul></li>
<li>page 也是从 pact 延伸过来的，一页纸，那是压平的纸浆呀。</li>
</ul>
